Autodesk.Revit.DB.IParamDefExternalButtonValueProvider.ShouldBeListed(Autodesk.Revit.DB.Document)
this is temp interface method for 2025.0 release to hide the substitution parameter from later point releases saved model with the substitution data
Since:
2025

Autodesk.Revit.DB.IParamDefExternalButtonValueProvider.GetProviderName
Since:
2025

Autodesk.Revit.DB.IParamDefExternalButtonValueProvider.GetProviderId
Since:
2025

Autodesk.Revit.DB.IParamDefExternalButtonValueProvider.GetParameterName(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Since:
2025

Autodesk.Revit.DB.IParamDefExternalButtonValueProvider.GetStringRepresentation(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId)
Since:
2025

Autodesk.Revit.DB.IParamDefExternalButtonValueProvider
IParamDefExternalButtonValueProvider.
Since:
2025